Revit 2027 API
UnitTypeId.KipsPerSquareFoot Property
 Kips per square foot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId KipsPerSquareFoot { get; }
Public Shared ReadOnly Property KipsPerSquareFoot As ForgeTypeId
	Get
public:
static property ForgeTypeId^ KipsPerSquareFoot {
	ForgeTypeId^ get ();
}
static member KipsPerSquareFoot : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace